// Символы карты: '=' тайл, '^' шип, 'C' монета, 'P' старт, 'F' флаг, '.' пусто.
// enemies: { x, y } в ТАЙЛАХ; patrol [minTile, maxTile] в тайлах.
// movingPlatforms: { x, y } в тайлах; axis 'x'|'y'; range в тайлах; speed px/с.
const LEGEND = {
  "=": "tile", "^": "spike", C: "coin", P: "player", F: "flag", ".": "empty",
};

export const LEVELS = [
  {
    name: "Разминка",
    tileSize: 32,
    legend: LEGEND,
    map: [
      "..........................",
      "..........................",
      "..............C...........",
      "..........C...............",
      ".......======.............",
      "..C.......................",
      "P.........................",
      "====......^^^.=======.F...",
      "====......===.........=...",
      "====......===.........=...",
    ],
    enemies: [{ x: 16, y: 6, patrol: [14, 20] }],
    movingPlatforms: [],
  },
  {
    name: "Перепрыгни",
    tileSize: 32,
    legend: LEGEND,
    map: [
      "..........................",
      "...............C..........",
      "..........................",
      ".....C..........C.........",
      "....===.........===.......",
      "..........................",
      "P.....C..............C..F.",
      "===.====..^^^^.......=====",
      "===.......====.......=====",
    ],
    enemies: [{ x: 5, y: 5, patrol: [4, 7] }],
    movingPlatforms: [{ x: 11, y: 5, axis: "x", range: 4, speed: 80 }],
  },
  {
    name: "Финальный рывок",
    tileSize: 32,
    legend: LEGEND,
    map: [
      "..........................",
      "............C.............",
      "........C.................",
      "....C.....................",
      "...===....................",
      "..............C....C......",
      "P....^^...................",
      "===.=========....^^^=====F",
      "===.====.........===.....=",
    ],
    enemies: [
      { x: 9, y: 6, patrol: [8, 12] },
      { x: 22, y: 6, patrol: [20, 24] },
    ],
    movingPlatforms: [{ x: 13, y: 4, axis: "y", range: 2, speed: 60 }],
  },
];
